Revit 2027 API
SolidGeometryOptions Constructor
 Creates a new SolidOptions class with solid tag settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SolidGeometryOptions(
	int solidTag
)
Public Sub New (
	solidTag As Integer
)
public:
SolidGeometryOptions(
	int solidTag
)
new :
        solidTag : int -> SolidGeometryOptions
Parameters
solidTag Int32
 The material id for the Solid.
See Also
Reference
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace